tests/fixtures/Customer/customer.with-subscription-with-discount.json

{
    "object": "customer",
    "created": 1407852586,
    "id": "cus_4ZpdOIgXTGsiax",
    "livemode": false,
    "description": null,
    "email": "user@example.com",
    "delinquent": false,
    "metadata": {},
    "subscriptions": {
        "object": "list",
        "total_count": 1,
        "has_more": false,
        "url": "/v1/customers/cus_4ZpdOIgXTGsiax/subscriptions",
        "data": [
            {
                "id": "sub_4ZpdfFhUCGlITA",
                "plan": {
                    "interval": "month",
                    "name": "Agency",
                    "created": 1370600333,
                    "amount": 1900,
                    "currency": "gbp",
                    "id": "agency-19",
                    "object": "plan",
                    "livemode": false,
                    "interval_count": 1,
                    "trial_period_days": 30,
                    "metadata": {},
                    "statement_description": null
                },
                "object": "subscription",
                "start": 1407852588,
                "status": "trialing",
                "customer": "cus_4ZpdOIgXTGsiax",
                "cancel_at_period_end": false,
                "current_period_start": 1407852588,
                "current_period_end": 1410444380,
                "ended_at": null,
                "trial_start": 1407852588,
                "trial_end": 1410444380,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "metadata": {}
            }
        ],
        "count": 1
    },
    "discount": {
        "coupon": {
            "id": "TMS",
            "created": 1407422003,
            "percent_off": 20,
            "amount_off": null,
            "currency": null,
            "object": "coupon",
            "livemode": false,
            "duration": "forever",
            "redeem_by": null,
            "max_redemptions": null,
            "times_redeemed": 7,
            "duration_in_months": null,
            "valid": true,
            "metadata": {}
        },
        "start": 1407852586,
        "object": "discount",
        "customer": "cus_4ZpdOIgXTGsiax",
        "subscription": null,
        "end": null
    },
    "account_balance": 0,
    "currency": "gbp",
    "cards": {
        "object": "list",
        "total_count": 0,
        "has_more": false,
        "url": "/v1/customers/cus_4ZpdOIgXTGsiax/cards",
        "data": [],
        "count": 0
    },
    "default_card": null,
    "active_card": null,
    "subscription": {
        "id": "sub_4ZpdfFhUCGlITA",
        "plan": {
            "interval": "month",
            "name": "Agency",
            "created": 1370600333,
            "amount": 1900,
            "currency": "gbp",
            "id": "agency-19",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": 30,
            "metadata": {},
            "statement_description": null
        },
        "object": "subscription",
        "start": 1407852588,
        "status": "trialing",
        "customer": "cus_4ZpdOIgXTGsiax",
        "cancel_at_period_end": false,
        "current_period_start": 1407852588,
        "current_period_end": 1410444380,
        "ended_at": null,
        "trial_start": 1407852588,
        "trial_end": 1410444380,
        "canceled_at": null,
        "quantity": 1,
        "application_fee_percent": null,
        "discount": null,
        "metadata": {}
    }
}